//
//  KeywordContentsModel.swift
//  ICO-iOS
//
//  Created by do_yun on 2021/11/23.
//

import Foundation
struct KeywordContentsModel{
    let titleIconImage = [
        "illust-product-vegan",
        "illust-product-upcycling",
        "illust-product-package"
        ]
    let title = [
        "비건을 위한 뷰티",
        "업사이틀링 패션",
        "지구를 살리는 패키지"
        ]
    let titleImage = [
        "illust-contents-cleanbeauty",
        "illust-contents-upcycling",
        "illust-contents-package"
        ]
    let content = [
        "요즘 정말 다양한 비건 브랜드들이 나오고 있습니다. 올리브영만 가도 비건을 위한 화장품들이 눈에 띄는데요.",
        "이번 컨텐츠는 버려지는 폐기물들을 이용해 아름다운 제품을 만드는 업사이클링에 대한 이야기입니다.",
        "아이코 여러분도 구매할 때 그 제품의 패키징을 고려하고 구매하시나요? 요즘은 패키지의 디자인, 기능적인 측면뿐만 아니라 친환경 패키지 여부를 중요하게 고려한다고 합니다."
        ]
    let content2 = [
        "이번 컨텐츠에서는 다양한 비건 코스메틱 브랜드를 소개해보려고 합니다. 가치있는 아름다움을 추구하는 우리 모든 아이코들에게 도움될 내용일 것 같아요.",
        "폐기물에서부터 탄생하였지만, 독특하고 트렌디한 멋을 가진 다양한 업사이클링 브랜드 소개를 해보려해요. 평소에 지속가능한 패션에 대해 관심이 많았던 아이코들을 위한 글이에요.",
        "친환경 패키지라고 하면 자동으로 떠오른 이미지가 있습니다. 갈색의 탁한 색상에 일반 종이와는 다른 질감의 종이로 포장되어있는 이미지가 떠오르죠. 우리는 친환경 패키지에 대해 제대로 알고 있는걸까요? 이번 컨텐츠에서는 지구를 살리는 패키지의 종류에 대해서 얘기해보려고 합니다."
        ]
}
struct ContentsBrand1{
    let brandTitle = [
        "세계적으로 인기있는\n업사이클링 브랜드, 프라이탁",
        "예술을 업사이클링으로\n승화시키다, 얼킨",
        "소방관의 가치를 알리는\n브랜드, 119REO"
    ]
    let brandImage = [
        "img-contents-lush",
        "img-contents-melixer",
        "img-contents-deardahlia"
        ]
    let brandDes = [
        "러쉬의 모든 제품들은 비건을 위한 제품들입니다. 러쉬라는 브랜드가 시작되고 나서부터 지금까지 26년째 동물실험을 진행한 재료들 혹은 상품은 절대 사용하지 않는다고 합니다. ",
        "멜릭서는 완전 채식주의를 추구하는 국내 코스메틱 브랜드입니다. 멜릭서에서 판매하는 모든 제품은 식물성 원료만을 사용하여 만듭니다.",
        "디어달리아는 달리아라는 꽃에서 영감을 받은 클린뷰티 브랜드입니다. 디어달리아라는 브랜드에서 느껴지는 이미지는 다른 클린뷰티 브랜드와는 살짝 다릅니다. 고급스럽고 현대적인 디자인이 어우러진 여러가지 색조 메이크업 제품들을 선보이고 있습니다."
        ]
    let brandDes2 = [
        "러쉬의 상품에 표시되어있는 ‘영국 비건 협회’의 인증마크를 통해 해당 상품이 동물성 원료를 사용하지 않는다는 것을 확인할 수 있는데요. 러쉬가 인증받기 위해서 갖춘 조건은 다음과 같습니다. ",
        "멜릭서의 패키지를 보면 모두 종이를 이용해 구성한 것을 볼 수 있습니다. 지속가능한 사회를 위해 패키지 또한 FSC 인증 소재를 사용해서 제작한다고 합니다. 멜릭서는 여러 인증 절차를 거친 재료들을 사용하는데요. 멜릭서가 사용하는 재료들은 다음과 같습니다.",
        "화려하지만 윤리적인 브랜드 디어달리아는 제품을 개발할 때 아래의 약속들을 지킨다고 합니다. "
        ]
    let brandDes3 = [
        "이처럼 러쉬는 비건 코스케틱 브랜드로 인정받기 위해 여러 인증 절차를 거치고 있습니다. 모두에게 사랑받는 브랜드 러쉬, 추천드립니다.",
        "이처럼 다양한 범위에서 지속가능한 사회를 위해 노력하는 브랜드 멜릭서, 추천드립니다. ",
        "현대적인 미를 가진 비건 뷰티 브랜드 디어달리아, 아이코 여러분께 추천드립니다. :)"
        ]
    let brandCheck = [
        "동물실험을 하지 않았는가",
        "지속가능한 FSC 인증 소재",
        "동물성 원료 및 동물 실험 반대"
        ]
    let brandCheck2 = [
        "동물성 원료 및 동물 유래 성분을 사용하지 않았는가",
        "ECOERT와 USDA 인증 원료",
        "비건 원료를 이용한 제품 생산"
        ]
    let brandCheck3 = [
        "동물성 원료 및 동물 유래 성분과의 교차오염이 없는가",
        "보성에서 수확한 유기농 녹차잎",
        "달리아꽃추출물 함유"
        ]
}
struct ContentsBrand2{
    let brandTitle = [
        "모두에게 사랑받는\n세계적인 브랜드, 러쉬",
        "완전 채식주의만을 추구하는\n착한 브랜드, 멜릭서",
        "럭셔리 비건 뷰티 브랜드,\n디어달리아"
    ]
    let brandImage = [
        "img-contents-freitag",
        "img-contents-ulkin",
        "img-contents-119reo"
        ]
    let brandDes = [
        "프라이탁은 디자이너의 작업물이 젖지 않는 튼튼한 가방에 대한 니즈에서부터 시작되었습니다. 작업물을 튼튼하게 보호해줄 수 있는 재질은 다름 아닌 버려진 방수천, 폐자전거의 고무튜브, 타이어 들이었습니다.",
        "얼킨은 일반적인 업사이클링 브랜드와 다른 방식으로 제품을 만듭니다. 신진 아티스트들 혹은 미대생들이 작업하고 버려지는 습작들이 얼킨의 제품으로 새롭게 탄생합니다.",
        "119REO는 소방관의 가치를 알리는 브랜드입니다. 소방관이 사용한 방화복을 사용해 업사이클링 제품을 제작하고 판매한 수익의 50%를 소방기관에 기부한다고 합니다. "
        ]
    let brandDes2 = [
        "프라이탁은 직접 수집한 폐타이어, 방수천 등을 세탁하고, 도안에 맞게 컷팅하여 제작합니다. 직접 수작업으로 가방 공정이 이루어지다 보니 프라이탁은 고가의 가격대를 이루고 있습니다.",
        "얼킨은 사회적인 이슈와 환경적인 이슈를 모두 해결하려는 브랜드입니다. 경제적으로 어려운 작가들의 회화작품을 구매하고, 업사이클링 제품을 만들어 파는 구조로 이어집니다.",
        "실제로 방화복 재질로 만들었기 때문에 제품은 비, 눈에 강하며 불에 타지 않는 방화 기능 또한 있는 소재입니다. 또한 가져온 방화복을 여러번 세탁하고 방화복을 분해하여 봉제를 거치는 과정을 수작업으로 진행한다고 합니다."
        ]
    let brandDes3 = [
        "트렌디한 멋을 가진 프라이탁 가방은 전세계적으로 매니아층이 많은 브랜드입니다. 사용할수록 더 빈티지한느낌이 드러나는 것이 프라이탁만의 매력입니다.",
        "얼킨은 신진작가들의 창작활동을 지원해주면서 환경을 위한 제품을 판매하는 매력적인 브랜드입니다. 실제로 세상에 하나밖에 없는 작품이 패션으로 승화되어 나의 것이 된다는 점이 매우 매력적인 것 같습니다.",
        "견고한 소재, 환경을 위한 좋은 영향을 줄 뿐만아니라, 소방관을 위한 메시지를 알리는 브랜드이기 때문에 더욱 가치가 있는 브랜드인 것 같습니다. :)"
        ]
    let brandCheck = [String]()
    let brandCheck2 = [String]()
    let brandCheck3 = [String]()
}
struct ContentsBrand3{
    let brandTitle = [
        "종이를 재사용한\n재생종이 패키지",
        "친환경 플라스틱?\n바이오 플라스틱!",
        "한번 더 체크해볼 사항,\nFSC 인증 소재"
    ]
    let brandImage = [
        "img-contents-craft",
        "img-contents-bioplastic",
        "img-contents-fsc"
        ]
    let brandDes = [
        "크라프트지는 종이를 여러번 재사용한 패키지입니다. 약간 거친 질감과 어두운 색깔이 특징인데요. 재생지로 친환경 패키지에 자주 사용되는 용지 중 하나입니다.",
        "플라스틱도 환경을 위한 소재가 될 수 있습니다. 바이오 플라스틱은 바이오매스를 이용한 소재의 플라스틱입니다. 보통 바이오매스는 사탕수수, 볏짚 등의 식물성 소재를 이용합니다.",
        "가끔 친환경 패키지들을 보면 FSC 인증 로고가 프린트되어 있는 것을 종종 보셨을 거예요. 산림인증제도를 통해 벌목한 숲의 생산부터 유통까지 모든 절차가 인증 기준에 충족되어야 받을 수 있는 마크입니다."
        ]
    let brandDes2 = [
        "또한 크라프트지 뿐만 아니라 다양한 친환경 용지들이 있습니다. 비목재지 같은 경우에는 나무대신 사탕수수, 과일 껍질 등으로 제작된 용지입니다. 특히 비목재지 중 사탕수수로 제작된 종이는 재활용 과정 또한 친환경적입니다. 미생물로 생분해가 가능하다는 점에서 환경을 위한 탁월한 선택인 것 같습니다. ",
        "바이오 플라스틱에서도 생분해성 플라스틱과 바이오매스 기반 플라스틱으로 분류됩니다. 생분해성 플라스틱같은 경우에는, 바이오매스 비율이 50%-70%에 해당하는 소재로 분해되었을 때, 물과 이산화탄소로 분해되는 소재입니다. 바이오매스 기반 플라스틱은 바이오매스의 비율이 5-25%에 해당하는 소재로, 완전히 생분해되지 않지만 이산화탄소 발생량을 유의미하게 줄일 수 있다는 점에서 친환경적이라고 볼 수 있습니다.",
        "많은 기업들이 FSC 인증 마크를 받은 종이를 사용하여 패키지를 제작하려하고 있다고 합니다. 산림인증제도는 종이 뿐만 아니라 목재 등 나무를 이용한 소재에서 찾아볼 수 있는 인증마크입니다."
        ]
    let brandDes3 = [
        "",
        "",
        ""
        ]
    let brandCheck = [String]()
    let brandCheck2 = [String]()
    let brandCheck3 = [String]()
}
